# ColorNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..ColorNumber Property
ExportLayerInfo Class See Also
---
The color number stored in value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int ColorNumber { get; set; }
```

Visual Basic
---
```text
Public Property ColorNumber As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ColorNumber {
	int get ();
	void set (int value);
}
```

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace